; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob96) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 depot1)
	(clear crate8)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate7)
	(at pallet4 distributor1)
	(clear crate5)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot1)
	(clear crate9)
	(at pallet7 distributor0)
	(clear pallet7)
	(at pallet8 distributor1)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear pallet9)
	(at pallet10 depot2)
	(clear crate6)
	(at pallet11 distributor2)
	(clear pallet11)
	(at pallet12 distributor1)
	(clear crate10)
	(at pallet13 distributor1)
	(clear crate1)
	(at pallet14 distributor2)
	(clear pallet14)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 402)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 326)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at hoist10 depot0)
	(available hoist10)
	(at hoist11 depot1)
	(available hoist11)
	(at hoist12 distributor0)
	(available hoist12)
	(at crate0 distributor1)
	(on crate0 pallet13)
	(= (weight crate0) 57)
	(at crate1 distributor1)
	(on crate1 crate0)
	(= (weight crate1) 85)
	(at crate2 depot1)
	(on crate2 pallet6)
	(= (weight crate2) 7)
	(at crate3 depot0)
	(on crate3 pallet0)
	(= (weight crate3) 96)
	(at crate4 depot0)
	(on crate4 crate3)
	(= (weight crate4) 3)
	(at crate5 distributor1)
	(on crate5 pallet4)
	(= (weight crate5) 15)
	(at crate6 depot2)
	(on crate6 pallet10)
	(= (weight crate6) 26)
	(at crate7 distributor0)
	(on crate7 pallet3)
	(= (weight crate7) 90)
	(at crate8 depot1)
	(on crate8 pallet1)
	(= (weight crate8) 73)
	(at crate9 depot1)
	(on crate9 crate2)
	(= (weight crate9) 74)
	(at crate10 distributor1)
	(on crate10 pallet12)
	(= (weight crate10) 79)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet14)
		(on crate1 pallet2)
		(on crate2 pallet12)
		(on crate3 pallet7)
		(on crate4 pallet3)
		(on crate5 crate7)
		(on crate6 pallet13)
		(on crate7 pallet5)
		(on crate8 pallet6)
		(on crate9 crate6)
		(on crate10 pallet9)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist10 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist10) (on crate4 crate3)
   added: (lifting hoist10 crate4) (clear crate3)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 11
2. (lift hoist6 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist6) (on crate3 pallet0)
   added: (lifting hoist6 crate3) (clear pallet0)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 11
3. (lift hoist1 crate9 crate2 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist1) (on crate9 crate2)
   added: (lifting hoist1 crate9) (clear crate2)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 11
4. (lift hoist4 crate1 crate0 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 crate0)
   added: (lifting hoist4 crate1) (clear crate0)
   changed: (fuel-cost) from 3 to 4
   goals met: 0 of 11
5. (load hoist4 crate1 truck0 distributor1)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck0) (available hoist4)
   changed: (current_load truck0) from 0 to 85
   goals met: 0 of 11
6. (lift hoist4 crate0 pallet13 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 pallet13)
   added: (lifting hoist4 crate0) (clear pallet13)
   changed: (fuel-cost) from 4 to 5
   goals met: 0 of 11
7. (load hoist4 crate0 truck0 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck0) (available hoist4)
   changed: (current_load truck0) from 85 to 142
   goals met: 0 of 11
8. (lift hoist11 crate2 pallet6 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist11) (on crate2 pallet6)
   added: (lifting hoist11 crate2) (clear pallet6)
   changed: (fuel-cost) from 5 to 6
   goals met: 0 of 11
9. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 6 to 16
   goals met: 0 of 11
10. (load hoist11 crate2 truck0 depot1)
   deleted: (lifting hoist11 crate2)
   added: (in crate2 truck0) (available hoist11)
   changed: (current_load truck0) from 142 to 149
   goals met: 0 of 11
11. (load hoist1 crate9 truck0 depot1)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 149 to 223
   goals met: 0 of 11
12. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 16 to 26
   goals met: 0 of 11
13. (load hoist10 crate4 truck0 depot0)
   deleted: (lifting hoist10 crate4)
   added: (in crate4 truck0) (available hoist10)
   changed: (current_load truck0) from 223 to 226
   goals met: 0 of 11
14. (lift hoist1 crate8 pallet1 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 pallet1)
   added: (lifting hoist1 crate8) (clear pallet1)
   changed: (fuel-cost) from 26 to 27
   goals met: 0 of 11
15. (drop hoist1 crate8 pallet6 depot1)
   deleted: (lifting hoist1 crate8) (clear pallet6)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 pallet6)
   goals met: 1 of 11
16. (load hoist6 crate3 truck0 depot0)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck0) (available hoist6)
   changed: (current_load truck0) from 226 to 322
   goals met: 1 of 11
17. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 27 to 37
   goals met: 1 of 11
18. (unload hoist2 crate1 truck0 depot2)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 322 to 237
   goals met: 1 of 11
19. (drop hoist2 crate1 pallet2 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 pallet2)
   goals met: 2 of 11
20. (unload hoist2 crate9 truck0 depot2)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck0) from 237 to 163
   goals met: 2 of 11
21. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 37 to 47
   goals met: 2 of 11
22. (unload hoist5 crate0 truck0 distributor2)
   deleted: (in crate0 truck0) (available hoist5)
   added: (lifting hoist5 crate0)
   changed: (current_load truck0) from 163 to 106
   goals met: 2 of 11
23. (drop hoist5 crate0 pallet14 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet14)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet14)
   goals met: 3 of 11
24. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 47 to 57
   goals met: 3 of 11
25. (unload hoist3 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist3)
   added: (lifting hoist3 crate3)
   changed: (current_load truck0) from 106 to 10
   goals met: 3 of 11
26. (unload hoist9 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist9)
   added: (lifting hoist9 crate4)
   changed: (current_load truck0) from 10 to 7
   goals met: 3 of 11
27. (drop hoist3 crate3 pallet7 distributor0)
   deleted: (lifting hoist3 crate3) (clear pallet7)
   added: (available hoist3) (at crate3 distributor0) (clear crate3) (on crate3 pallet7)
   goals met: 4 of 11
28. (lift hoist3 crate7 pallet3 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist3) (on crate7 pallet3)
   added: (lifting hoist3 crate7) (clear pallet3)
   changed: (fuel-cost) from 57 to 58
   goals met: 4 of 11
29. (drop hoist9 crate4 pallet3 distributor0)
   deleted: (lifting hoist9 crate4) (clear pallet3)
   added: (available hoist9) (at crate4 distributor0) (clear crate4) (on crate4 pallet3)
   goals met: 5 of 11
30. (load hoist3 crate7 truck0 distributor0)
   deleted: (lifting hoist3 crate7)
   added: (in crate7 truck0) (available hoist3)
   changed: (current_load truck0) from 7 to 97
   goals met: 5 of 11
31. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 58 to 68
   goals met: 5 of 11
32. (lift hoist4 crate10 pallet12 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 pallet12)
   added: (lifting hoist4 crate10) (clear pallet12)
   changed: (fuel-cost) from 68 to 69
   goals met: 5 of 11
33. (load hoist4 crate10 truck0 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck0) (available hoist4)
   changed: (current_load truck0) from 97 to 176
   goals met: 5 of 11
34. (unload hoist4 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist4)
   added: (lifting hoist4 crate2)
   changed: (current_load truck0) from 176 to 169
   goals met: 5 of 11
35. (drop hoist4 crate2 pallet12 distributor1)
   deleted: (lifting hoist4 crate2) (clear pallet12)
   added: (available hoist4) (at crate2 distributor1) (clear crate2) (on crate2 pallet12)
   goals met: 6 of 11
36. (lift hoist4 crate5 pallet4 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 pallet4)
   added: (lifting hoist4 crate5) (clear pallet4)
   changed: (fuel-cost) from 69 to 70
   goals met: 6 of 11
37. (load hoist4 crate5 truck0 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck0) (available hoist4)
   changed: (current_load truck0) from 169 to 184
   goals met: 6 of 11
38. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 70 to 80
   goals met: 6 of 11
39. (unload hoist5 crate7 truck0 distributor2)
   deleted: (in crate7 truck0) (available hoist5)
   added: (lifting hoist5 crate7)
   changed: (current_load truck0) from 184 to 94
   goals met: 6 of 11
40. (drop hoist5 crate7 pallet5 distributor2)
   deleted: (lifting hoist5 crate7) (clear pallet5)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 pallet5)
   goals met: 7 of 11
41. (unload hoist5 crate5 truck0 distributor2)
   deleted: (in crate5 truck0) (available hoist5)
   added: (lifting hoist5 crate5)
   changed: (current_load truck0) from 94 to 79
   goals met: 7 of 11
42. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 80 to 90
   goals met: 7 of 11
43. (unload hoist3 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist3)
   added: (lifting hoist3 crate10)
   changed: (current_load truck0) from 79 to 0
   goals met: 7 of 11
44. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 90 to 100
   goals met: 7 of 11
45. (drop hoist5 crate5 crate7 distributor2)
   deleted: (lifting hoist5 crate5) (clear crate7)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 crate7)
   goals met: 8 of 11
46. (drop hoist3 crate10 pallet9 distributor0)
   deleted: (lifting hoist3 crate10) (clear pallet9)
   added: (available hoist3) (at crate10 distributor0) (clear crate10) (on crate10 pallet9)
   goals met: 9 of 11
47. (load hoist2 crate9 truck0 depot2)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 74
   goals met: 9 of 11
48. (lift hoist2 crate6 pallet10 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 pallet10)
   added: (lifting hoist2 crate6) (clear pallet10)
   changed: (fuel-cost) from 100 to 101
   goals met: 9 of 11
49. (load hoist2 crate6 truck0 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 74 to 100
   goals met: 9 of 11
50. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 101 to 111
   goals met: 9 of 11
51. (unload hoist4 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck0) from 100 to 74
   goals met: 9 of 11
52. (drop hoist4 crate6 pallet13 distributor1)
   deleted: (lifting hoist4 crate6) (clear pallet13)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 pallet13)
   goals met: 10 of 11
53. (unload hoist4 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist4)
   added: (lifting hoist4 crate9)
   changed: (current_load truck0) from 74 to 0
   goals met: 10 of 11
54. (drop hoist4 crate9 crate6 distributor1)
   deleted: (lifting hoist4 crate9) (clear crate6)
   added: (available hoist4) (at crate9 distributor1) (clear crate9) (on crate9 crate6)
   goals met: 11 of 11
